Revit 2027 API
BuiltInFailures.DimensionFailures.ChangeDimensionSegmentFailed Property
 Can't change dimension segment to this value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ChangeDimensionSegmentFailed { get; }
Public Shared ReadOnly Property ChangeDimensionSegmentFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ChangeDimensionSegmentFailed {
	FailureDefinitionId^ get ();
}
static member ChangeDimensionSegmentFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace